// 1. import the defineConfigWithTheme function
import { defineConfigWithTheme ,loadEnv} from 'vitepress'
// 2. import configuration objects that need to be inherited
import escookConfig from '@escook/vitepress-theme/config'

// import { nav } from './relaConf/index'
//配置的英文文档设置
import { enConfig } from './src/config/en'
//配置的中文文档设置
import { zhConfig } from './src/config/zh'
const env = loadEnv('', "./")
  // 创建全局环境变量对象
const globalEnv = {};
Object.keys(env).forEach(key => {
  if (key.startsWith('VITE_')) {
    globalEnv[key] = env[key];
  }
});
export default defineConfigWithTheme({
    // 3. specify the configuration to inherit via extended
    extends: escookConfig,
    title: env.VITE_APP_NAME,
    description: env.VITE_APP_NAME,
    vite: {
      define: {
        // 将环境变量注入全局对象
        __VITE_ENV__: JSON.stringify(globalEnv),
      }
    },
    themeConfig: {
      // musicBall: {
      //   src: '/music/森林狂想曲.mp3',
      //   autoplay: false,
      // },
      logo: '/images/logo.png',
      socialLinks:[
        {
          icon: {
          svg: '<svg t="1752681186818" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2461" width="200" height="200"><path d="M576 896v48h-96v-48a48 48 0 0 1 96 0z" fill="#C7874E" p-id="2462"></path><path d="M658.56 101.76l-40 39.84L512 80l-214.88 124.48-40.64-40.64L512 16l144.16 83.36z" fill="#80786A" p-id="2463"></path><path d="M407.84 784l-128 128-67.84-67.84-17.76-17.76 232.16-232.16L512 679.84zM272 439.84l-208-208 85.6-85.6 232.16 232.16L296.16 464zM618.56 141.6l40-39.84L744.16 16l85.6 85.6-232.16 232.16L512 248.16zM960 696.16l-85.6 85.6-232.16-232.16L727.84 464l20.16 20.16z" fill="#A7E340" p-id="2464"></path><path d="M874.4 781.76l5.6 5.6L835.36 832l-17.6-17.6-32-32-256.8-256.8a63.504 63.504 0 0 0 44.64-44.64l68.64 68.64zM426.4 594.24L194.24 826.4l-5.6 5.6L144 787.36l129.76-129.6 176.64-176.8a63.504 63.504 0 0 0 44.64 44.64zM297.12 204.48l197.92 197.92a63.504 63.504 0 0 0-44.64 44.64l-68.64-68.64L149.6 146.24 144 140.64 188.64 96l67.84 67.84zM829.76 101.6l5.6-5.6L880 140.64l-129.6 129.76-176.8 176.64a63.504 63.504 0 0 0-44.64-44.64l68.64-68.64z" fill="#EDE9E1" p-id="2465"></path><path d="M1008 1008H16a63.92 63.92 0 0 1 64-64h864a64 64 0 0 1 64 64z" fill="#635D50" p-id="2466"></path><path d="M279.84 912l128-128H784l1.76-1.6 32 32-1.76 1.6v128H576v-48a48 48 0 0 0-96 0v48H208v-96l4-3.84z" fill="#CDC3B4" p-id="2467"></path><path d="M752 272v208l-4 4.16L727.84 464l-85.6 85.6-68.64-68.64a61.12 61.12 0 0 0 0-33.92L750.4 270.4zM785.76 782.4L784 784H407.84L512 679.84l-85.6-85.6 68.64-68.64a61.12 61.12 0 0 0 33.92 0zM450.4 480.96L273.76 657.76 272 656V439.84L296.16 464l85.6-85.6 68.64 68.64a61.12 61.12 0 0 0 0 33.92zM618.56 141.6L512 248.16l85.6 85.6-68.64 68.64a61.12 61.12 0 0 0-33.92 0L297.12 204.48 512 80z" fill="#C7874E" p-id="2468"></path><path d="M512 464m-64 0a64 64 0 1 0 128 0 64 64 0 1 0-128 0Z" fill="#80786A" p-id="2469"></path><path d="M512 464m-32 0a32 32 0 1 0 64 0 32 32 0 1 0-64 0Z" fill="#544F43" p-id="2470"></path><path d="M804.08 75.92l-157.456 157.456a32 32 0 0 1-45.248 0l-37.296-37.296L512 248.16l85.6 85.6L829.76 101.6z" fill="#86C42B" p-id="2471"></path><path d="M857.68 118.4L598.624 377.376a32 32 0 0 1-44.912 0.272L528.96 402.4a63.504 63.504 0 0 1 44.64 44.64L750.4 270.4 880 140.64z" fill="#DED9D0" p-id="2472"></path><path d="M561.92 862.08A48 48 0 0 0 480 896v32a48 48 0 0 1 96 0v-32a47.888 47.888 0 0 0-14.08-33.92z" fill="#B56E2F" p-id="2473"></path><path d="M80 976h864a63.712 63.712 0 0 1 55.136 32H1008a64 64 0 0 0-64-64H80a63.92 63.92 0 0 0-64 64h8.896a65.92 65.92 0 0 1 9.824-13.28A64.4 64.4 0 0 1 80 976z" fill="#80786A" p-id="2474"></path><path d="M750.4 270.4L720 300.768V471.84l7.84-7.84 20.16 20.16L752 480V272z" fill="#E9AA70" p-id="2475"></path><path d="M656.16 99.36l-42.784-24.736L592 96l-80-48-237.664 133.696 22.784 22.784L512 80l106.56 61.6 40-39.84z" fill="#544F43" p-id="2476"></path><path d="M450.4 447.04l-68.64-68.64L296.16 464 272 439.84V480l32 32 80-80 32 32v16l-144 144v32l1.76 1.76 176.64-176.8a61.12 61.12 0 0 1 0-33.92zM528.96 525.6a61.12 61.12 0 0 1-33.92 0l-68.64 68.64 25.68 25.6L512 560l224 224h48l1.76-1.6z" fill="#B56E2F" p-id="2477"></path><path d="M593.632 912m16 0l96 0q16 0 16 16l0 0q0 16-16 16l-96 0q-16 0-16-16l0 0q0-16 16-16Z" fill="#BEB4AA" p-id="2478"></path><path d="M384 816m16 0l96 0q16 0 16 16l0 0q0 16-16 16l-96 0q-16 0-16-16l0 0q0-16 16-16Z" fill="#BEB4AA" p-id="2479"></path><path d="M728 912m15.632 0l16.736 0q15.632 0 15.632 15.632l0 0.736q0 15.632-15.632 15.632l-16.736 0q-15.632 0-15.632-15.632l0-0.736q0-15.632 15.632-15.632Z" fill="#BEB4AA" p-id="2480"></path><path d="M224 912m15.632 0l16.736 0q15.632 0 15.632 15.632l0 0.736q0 15.632-15.632 15.632l-16.736 0q-15.632 0-15.632-15.632l0-0.736q0-15.632 15.632-15.632Z" fill="#D6CEC1" p-id="2481"></path><path d="M640 880m15.632 0l16.736 0q15.632 0 15.632 15.632l0 0.736q0 15.632-15.632 15.632l-16.736 0q-15.632 0-15.632-15.632l0-0.736q0-15.632 15.632-15.632Z" fill="#D6CEC1" p-id="2482"></path><path d="M432 880m15.632 0l16.736 0q15.632 0 15.632 15.632l0 0.736q0 15.632-15.632 15.632l-16.736 0q-15.632 0-15.632-15.632l0-0.736q0-15.632 15.632-15.632Z" fill="#D6CEC1" p-id="2483"></path><path d="M688 864m15.632 0l48.736 0q15.632 0 15.632 15.632l0 0.736q0 15.632-15.632 15.632l-48.736 0q-15.632 0-15.632-15.632l0-0.736q0-15.632 15.632-15.632Z" fill="#BEB4AA" p-id="2484"></path><path d="M288 912m15.632 0l48.736 0q15.632 0 15.632 15.632l0 0.736q0 15.632-15.632 15.632l-48.736 0q-15.632 0-15.632-15.632l0-0.736q0-15.632 15.632-15.632Z" fill="#D6CEC1" p-id="2485"></path><path d="M336 848m15.632 0l48.736 0q15.632 0 15.632 15.632l0 0.736q0 15.632-15.632 15.632l-48.736 0q-15.632 0-15.632-15.632l0-0.736q0-15.632 15.632-15.632Z" fill="#BEB4AA" p-id="2486"></path><path d="M384 912m15.632 0l48.736 0q15.632 0 15.632 15.632l0 0.736q0 15.632-15.632 15.632l-48.736 0q-15.632 0-15.632-15.632l0-0.736q0-15.632 15.632-15.632Z" fill="#BEB4AA" p-id="2487"></path><path d="M608 832m15.632 0l48.736 0q15.632 0 15.632 15.632l0 0.736q0 15.632-15.632 15.632l-48.736 0q-15.632 0-15.632-15.632l0-0.736q0-15.632 15.632-15.632Z" fill="#BEB4AA" p-id="2488"></path><path d="M688 800m15.632 0l48.736 0q15.632 0 15.632 15.632l0 0.736q0 15.632-15.632 15.632l-48.736 0q-15.632 0-15.632-15.632l0-0.736q0-15.632 15.632-15.632Z" fill="#D6CEC1" p-id="2489"></path><path d="M123.92 171.92l157.456 157.456a32 32 0 0 1 0 45.248l-37.296 37.296L272 439.84 296.16 464l85.6-85.6L149.6 146.24z" fill="#86C42B" p-id="2490"></path><path d="M436.688 388.688L166.4 118.4 144 140.64l5.6 5.6 232.16 232.16 43.92 44 11.008-11.008a16 16 0 0 0 0-22.704z" fill="#DED9D0" p-id="2491"></path><path d="M426.4 594.24L194.24 826.4l17.76 17.76 7.92 8 173.456-173.536a32 32 0 0 1 45.248 0l37.296 37.296L512 679.84z" fill="#86C42B" p-id="2492"></path><path d="M470.288 550.4l24.752-24.8a63.504 63.504 0 0 1-44.64-44.64L273.76 657.76 144 787.36l22.4 22.32 258.976-259.056a32 32 0 0 1 44.912-0.224z" fill="#DED9D0" p-id="2493"></path><path d="M742.624 582.624a32 32 0 0 1 0-45.248l29.296-29.296-23.92-23.92L727.84 464l-85.6 85.6 232.16 232.16 33.68-33.6z" fill="#86C42B" p-id="2494"></path><path d="M598.4 505.712l-24.8-24.752a63.504 63.504 0 0 1-44.64 44.64L785.76 782.4l32 32 17.6 17.6 22.32-22.4-259.056-258.976a32 32 0 0 1-0.224-44.912z" fill="#DED9D0" p-id="2495"></path><path d="M528 832a64 64 0 0 0-64 64v48h16v-48a48 48 0 0 1 96 0v48h16v-48a64 64 0 0 0-64-64z" fill="#544F43" p-id="2496"></path><path d="M618.56 141.6L512 80l-214.88 124.48 30.88 30.864L512 128l32 16-96 96 96 96-57.6 57.68 8.72 8.72a61.12 61.12 0 0 1 33.92 0l68.64-68.64L512 248.16z" fill="#B56E2F" p-id="2497"></path><path d="M728.452048 93.966697a36.576 26.272 45 1 0 37.154219-37.154218 36.576 26.272 45 1 0-37.154219 37.154218Z" fill="#F6FAFD" p-id="2498"></path><path d="M705.636034 132.929456a18.368 13.2 45 1 0 18.667619-18.667619 18.368 13.2 45 1 0-18.667619 18.667619Z" fill="#F6FAFD" p-id="2499"></path><path d="M744.271029 590.041678a36.576 26.272 45 1 0 37.154218-37.154219 36.576 26.272 45 1 0-37.154218 37.154219Z" fill="#F6FAFD" p-id="2500"></path><path d="M801.475701 613.022378a18.368 13.2 45 1 0 18.667619-18.667619 18.368 13.2 45 1 0-18.667619 18.667619Z" fill="#F6FAFD" p-id="2501"></path><path d="M641.395701 756.989241a18.368 13.2 45 1 0 18.667619-18.667619 18.368 13.2 45 1 0-18.667619 18.667619Z" fill="#F6FAFD" p-id="2502"></path></svg>'
        } , link:env.VITE_API_URL}
      ],
      // nav: nav,
      // sidebar: [
      //   {
      //     text: 'Examples',
      //     items: [
      //       { text: 'Markdown Examples', link: '/markdown-examples' },
      //       { text: 'Runtime API Examples', link: '/api-examples' }
      //     ]
      //   }
      // ],
      // outline: {
      //   level: [2, 6], // 锚点导航只能配置h2-h6级的标题
      //   label: '快捷导航'
      // },
      i18nRouting: false,
      search: {
        // 本地离线搜索
        provider: "local",
        // 多语言搜索配置
        options: {
          locales: {
            /* 默认语言 */
            zh: {
              translations: {
                button: {
                  buttonText: "搜索",
                  buttonAriaLabel: "搜索文档",
                },
                modal: {
                  noResultsText: "无法找到相关结果",
                  resetButtonTitle: "清除查询结果",
                  footer: {
                    selectText: "选择",
                    navigateText: "切换",
                  },
                },
              },
            },
            en: {
              translations: {
                button: {
                  buttonText: "Search",
                  buttonAriaLabel: "Search for Documents",
                },
                modal: {
                  noResultsText: "Unable to find relevant results",
                  resetButtonTitle: "Clear Query Results",
                  footer: {
                    selectText: "select",
                    navigateText: "switch",
                  },
                },
              },
            },
          },
        },
      },
    },
    locales: {
      // root: {
      //   label: '中文',
      //   lang: 'zh-CN',
      // },
      zh: {
        label: '中文',
        lang: 'zh-CN', // 可选，将作为 `lang` 属性添加到 `html` 标签中
        link: '/index', // 默认 /fr/ -- 显示在导航栏翻译菜单上，可以是外部的
        ...zhConfig
      },
      en: {
        label: 'English',
        lang: 'en-US', // 可选，将作为 `lang` 属性添加到 `html` 标签中
        link: '/en/index', // 默认 /fr/ -- 显示在导航栏翻译菜单上，可以是外部的
        ...enConfig
      },
    }
  })